backend/controllers/ProjectController.php

    public function actionIndex()
    {
        $page = \Yii::$app->request->get('page',1);
        $page_size = \Yii::$app->request->get('page_size',20);
        $list = Project::findList($page,$page_size);
        // 查询一张图片作为封面图
        foreach ($list['list'] as $key => $value){
            $pro_img = ProjectImg::findOne(['pro_id'=>$value['pro_id']]);
---
SELECT * FROM `w_project_img` WHERE `pro_id`='145'