frontend/controllers/SiteController.php

    public function actionIndex()
    {
        // 比赛结束时间
        $end_timestamp = Config::findOne(['conf_key'=>'ProjectEndTime'])->conf_value;
---
SELECT * FROM `w_config` WHERE `conf_key`='ProjectEndTime'