common/models/Banner.php

    public static function findLists()
    {
        return Banner::find()
            ->select(['CONCAT("'.\Yii::$app->params['uploadHost'].'/'.'",ban_pic_src) as img_url','ban_link link_url'])
            ->where(['delete_flag'=>self::DELETE_FALSE,'ban_status'=>self::STATUS_ACTIVE])
            ->asArray()->all();
---
SELECT CONCAT("http://www.whngo.com/uploads/",ban_pic_src) as img_url, `ban_link` AS `link_url` FROM `w_banner` WHERE (`delete_flag`=0) AND (`ban_status`=1)