common/models/Feed.php

    public static function findListsByLimit($limit=4)
    {
        return self::find()->select([
            'content',
            'create_time',
            'img_url',
        ])->where(['status'=>self::STATUS_ACTIVE])->orderBy('create_time desc')->limit($limit)->asArray()->all();
---
SELECT `content`, `create_time`, `img_url` FROM `w_feed` WHERE `status`=1 LIMIT 4