common/models/Project.php

SELECT COUNT(*) FROM `w_project` WHERE (`w_project`.`status`=1) AND (`w_project`.`delete_flag`=0)
SELECT `w_project`.`pro_id`, `w_project`.`pro_name`, `w_project`.`pro_company`, `w_project`.`pro_content`, `w_project`.`record_number`, `w_project`.`user_truename`, `w_project`.`user_phone`, `w_project`.`user_address`, `w_project`.`funds_amount`, `w_project`.`support_amount`, `w_project`.`focus_amount`, `pt`.`type_name`, `u`.`user_nickname`, `u`.`headimg` FROM `w_project` INNER JOIN `w_project_type` `pt` ON pt.type_id=w_project.pro_type INNER JOIN `w_user` `u` ON u.user_id=w_project.user_id WHERE (`w_project`.`status`=1) AND (`w_project`.`delete_flag`=0) ORDER BY `w_project`.`funds_amount` DESC LIMIT 20
---
    public static function findList($page , $page_size)
    {
        $query = self::find()->where(['w_project.status'=>self::STATUS_ACTIVE,'w_project.delete_flag'=>self::DELETE_FALSE]);
        $count = $query->count();
        $list = $query->
        addSelect([
            'w_project.pro_id',
            'w_project.pro_name',
            'w_project.pro_company',
            'w_project.pro_content',
            'w_project.record_number',
            'w_project.user_truename',
            'w_project.user_phone',
            'w_project.user_address',
            'w_project.funds_amount',
            'w_project.support_amount',
            'w_project.focus_amount',
            'pt.type_name',
            'u.user_nickname',
            'u.headimg',
        ])
            ->innerJoin('w_project_type pt','pt.type_id=w_project.pro_type')
            ->innerJoin('w_user u','u.user_id=w_project.user_id')
            ->offset(($page-1)*$page_size)
            ->limit($page_size)
            ->orderBy('w_project.funds_amount desc')
            ->asArray()->all();