common/models/Support.php

    public static function findLastSupport($limit=5,$sort='support_id desc'){
        return Support::find()
            ->select([
                'u.user_nickname',
                'u.headimg',
                'w_support.word',
                'w_support.total_price',
                'FROM_UNIXTIME(w_support.create_time) AS create_time'
            ])
            ->innerJoin('w_user u','u.user_id=w_support.user_id')
            ->where(['w_support.status'=>"1"])
            ->limit($limit)
            ->orderBy($sort)
            ->asArray()->all();
---
SELECT `u`.`user_nickname`, `u`.`headimg`, `w_support`.`word`, `w_support`.`total_price`, FROM_UNIXTIME(w_support.create_time) AS create_time FROM `w_support` INNER JOIN `w_user` `u` ON u.user_id=w_support.user_id WHERE `w_support`.`status`='1' ORDER BY `support_id` DESC LIMIT 5